package nettyServer.util;

/**
 * @author zuojie.x
 */
public interface Head {
    /**
     * 错误码, 账号被禁止.
     */
    int errCode_banned = -1000;

    /**
     * 获取服务器id
     */
    int H998 = 998;
    /**
     * 关闭服务器
     */
    int H999 = 999;
    /**
     * 心跳
     */
    int H1000 = 1000;
    /**
     * 登陆
     */
    int H1001 = 1001;
    /**
     * 创建角色
     */
    int H1002 = 1002;
    /**
     * 获取随机角色名
     */
    int H1003 = 1003;
    /**
     * 重新登陆
     */
    int H1004 = 1004;
    /**
     * 登录成功后获取玩家数据
     */
    int H1005 = 1005;
    /**
     * 选择宠物
     */
    int H1006 = 1006;

    /**
     * 获取建筑列表
     */
    int H1101 = 1101;
    /**
     * 建筑升级
     */
    int H1102 = 1102;
    /**
     * 修复建筑
     */
    int H1103 = 1103;

    /**
     * 获取指定玩家的主城
     */
    int H1111 = 1111;

    // 冒险者商店======================================
    /**
     * 商品列表
     */
    int H1121 = 1121;
    /**
     * 购买
     */
    int H1122 = 1122;
    /**
     * 刷新列表
     */
    int H1123 = 1123;

    // 训练所======================================
    /**
     * 训练列表
     */
    int H1131 = 1131;
    /**
     * 开始训练
     */
    int H1132 = 1132;
    /**
     * 结束训练
     */
    int H1133 = 1133;

    // 铁匠铺======================================
    /**
     * 锻造装备
     */
    int H1141 = 1141;

    // 光之圣殿====================================
    /**
     * 获取圣殿信息
     */
    int H1151 = 1151;
    /**
     * 兑换水晶
     */
    int H1152 = 1152;

    // 矿井========================================
    /**
     * 更新可领取矿石数
     */
    int H1161 = 1161;
    /**
     * 领取矿石
     */
    int H1162 = 1162;
    /**
     * 购买矿石
     */
    int H1163 = 1163;
    /**
     * 矿产信息
     */
    int H1164 = 1164;

    // 贸易站========================================
    /**
     * 获取贸易信息
     */
    int H1171 = 1171;
    /**
     * 开始贸易
     */
    int H1172 = 1172;
    /**
     * 加速贸易
     */
    int H1173 = 1173;
    /**
     * 取消贸易
     */
    int H1174 = 1174;
    /**
     * 完成贸易
     */
    int H1175 = 1175;

    // 光之塔========================================
    /**
     * 获取光之塔信息
     */
    int H1181 = 1181;
    /**
     * 选择光源
     */
    int H1182 = 1182;

    // 冒险========================================
    /**
     * 获取章节列表
     */
    int H1201 = 1201;
    /**
     * 开始某个关卡
     */
    int H1202 = 1202;
    /**
     * 通关某个关卡
     */
    int H1203 = 1203;
    /**
     * 购买关卡的次数
     */
    int H1204 = 1204;
    /**
     * 领取章节奖励
     */
    int H1211 = 1211;
    /**
     * 扫荡信息
     */
    int H1212 = 1212;
    /**
     * 扫荡
     */
    int H1213 = 1213;

    // 黑市=======================================
    /**
     * 获取黑市开放状态
     */
    int H1221 = 1221;
    /**
     * 获取黑市商品列表
     */
    int H1222 = 1222;
    /**
     * 黑市购买
     */
    int H1223 = 1223;
    /**
     * 购买金币
     */
    int H1224 = 1224;
    /**
     * 获取冠军之路商品列表
     */
    int H1225 = 1225;
    /**
     * 冠军之路购买
     */
    int H1226 = 1226;

    // VIP商店====================================
    /**
     * 获取商品列表
     */
    int H1231 = 1231;
    /**
     * 购买
     */
    int H1232 = 1232;
    /**
     * 刷新列表
     */
    int H1233 = 1233;

    /**
     * 获取四大天王信息
     */
    int H1241 = 1241;

    // 十二星宫====================================
    /**
     * 获取十二星宫信息
     */
    int H1261 = 1261;
    /**
     * 领取通关难度奖励
     */
    int H1262 = 1262;
    /**
     * 重置星宫
     */
    int H1263 = 1263;
    /**
     * 获取十二星宫商店
     */
    int H1271 = 1271;
    /**
     * 刷新十二星宫商店
     */
    int H1272 = 1272;
    /**
     * 竞技十二星宫购买
     */
    int H1273 = 1273;

    // ARPG PVE========================================
    /**
     * 请求开始战斗
     */
	int H1301 = 1301;
    /**
     * 获取当前请求的PVE的战斗服务器信息
     */
	int H1302 = 1302;
    /**
     * 战斗结果
     */
	int H1303 = 1303;
    /**
     * 请求开始战斗
     */
    int H1304 = 1304;

    // 卡片========================================
    /**
     * 获取卡片共有数据
     */
    int H1400 = 1400;
    /**
     * 获取卡片列表
     */
    int H1401 = 1401;
    /**
     * 卡片升级
     */
    int H1402 = 1402;
    /**
     * 卡片强化
     */
    int H1403 = 1403;
    /**
     * 卡片升阶
     */
    int H1404 = 1404;
    /**
     * 卡片升星
     */
    int H1405 = 1405;
    /**
     * 卡片分解
     */
    int H1406 = 1406;
    /**
     * 升级技能
     */
    int H1407 = 1407;
    /**
     * 召唤卡片
     */
    int H1408 = 1408;
    /**
     * 卡片进化
     */
    int H1409 = 1409;
    /**
     * 卡片洗炼个体值
     */
    int H1410 = 1410;

    /*---------------------之前的装备协议废弃----------*/
    /**
     * 穿上装备
     */
    int H1411 = 1411;
    /**
     * 穿上装备-多件
     */
    int H1412 = 1412;
    /**
     * 装备强化
     */
    int H1413 = 1413;
    /**
     * 装备一键强化
     */
    int H1414 = 1414;
    /*---------------------之前的装备协议废弃----------*/
    /**
     * 觉醒
     */
    int H1415 = 1415;
    /**
     * 觉醒性格变更
     */
    int H1416 = 1416;

    /**
     * 卡片锁定
     */
    int H1421 = 1421;
    /**
     * 卡片恢复
     */
    int H1422 = 1422;
    /**
     * 卡片改名
     */
    int H1424 = 1424;
    /**
     * 备份个体值
     */
    int H1426 = 1426;
    /**
     * 还原个体值
     */
    int H1427 = 1427;
    /**
     * 性格洗炼
     */
    int H1428 = 1428;
    /**
     * 卡片重置
     */
    int H1429 = 1429;
    
    /**
     * mega进化
     */
    int H1430 = 1430;

    /**
     * 卡片技能升级
     */
    int H1435 = 1435;
    /**
     * 卡片技能位置调整
     */
    int H1436 = 1436;
    /**
     * 卡片技能变化时更新
     */
    int H1437 = 1437;

    /**
     * 努力值-增加
     */
    int H1451 = 1451;
    /**
     * 努力值-解锁阶段
     */
    int H1452 = 1452;
    /**
     * 努力值-重置
     */
    int H1453 = 1453;

    /**
     * 熏香-列表
     */
    int H1461 = 1461;
    /**
     * 熏香-使用物品刷新
     */
    int H1462 = 1462;
    /**
     * 熏香-一键击杀
     */
    int H1463 = 1463;
    /**
     * 熏香-一键捕捉
     */
    int H1464 = 1464;
    /**
     * 熏香-进入战斗
     */
    int H1465 = 1465;
    /**
     * 熏香-清除
     */
    int H1466 = 1466;
    /**
     * 熏香-获取使用熏香要消耗的sp
     */
    int H1467 = 1467;

    // 卡牌友情值====================================
    /**
     * 获取组合友情值
     */
    int H1431 = 1431;
    /**
     * 组合/合体技 升级
     */
    int H1432 = 1432;

    // 坐骑====================================
    /**
     * 坐骑列表
     */
    int H1440 = 1440;
    /**
     * 选择坐骑
     */
    int H1441 = 1441;

    // 阵形========================================
    /**
     * 阵形列表
     */
    int H1501 = 1501;
    /**
     * 更新阵型
     */
    int H1502 = 1502;
    /**
     * 一键下阵/训练所下阵
     */
    int H1503 = 1503;

    // 竞技场======================================
    /**
     * 获取竞技场信息
     */
    int H1601 = 1601;
    /**
     * 刷新/获取对手列表
     */
    int H1602 = 1602;
    /**
     * 开始挑战
     */
    int H1603 = 1603;
    /**
     * 结束挑战
     */
    int H1604 = 1604;
    /**
     * 获取战斗记录,竞技场,掠夺战
     */
    int H1605 = 1605;
    /**
     * 获取录像
     */
    int H1606 = 1606;
    /**
     * 获取排行榜
     */
    int H1607 = 1607;
    /**
     * 获取竞技场商店
     */
    int H1608 = 1608;
    /**
     * 刷新竞技场商店
     */
    int H1609 = 1609;
    /**
     * 竞技场商店购买
     */
    int H1610 = 1610;
    /**
     * 竞技场重置冷却时间
     */
    int H1611 = 1611;
    /**
     * 获取联盟商店
     */
    int H1612 = 1612;
    /**
     * 刷新联盟商店
     */
    int H1613 = 1613;
    /**
     * 联盟商店购买
     */
    int H1614 = 1614;

    // 掠夺战======================================
    /**
     * 掠夺战信息
     */
    int H1621 = 1621;
    /**
     * 刷新/获取对手列表
     */
    int H1622 = 1622;
    /**
     * 开始掠夺战
     */
    int H1623 = 1623;
    /**
     * 结束掠夺战
     */
    int H1624 = 1624;
    /**
     * 领取宝箱奖励
     */
    int H1625 = 1625;
    /**
     * 查看反击目标
     */
    int H1631 = 1631;
    /**
     * 开始反击
     */
    int H1632 = 1632;
    /**
     * 结束反击
     */
    int H1633 = 1633;
    /**
     * 点赞
     */
    int H1626 = 1626;

    //远古之路（远征）==============================
    /**
     * 远古之路信息
     */
    int H1641 = 1641;
    /**
     * 远古之路 开始远征战斗
     */
    int H1642 = 1642;
    /**
     * 远古之路  结束远征战斗
     */
    int H1643 = 1643;
    /**
     * 重置远古之路
     */
    int H1644 = 1644;
    /**
     * 领取远古之路宝箱奖励
     */
    int H1645 = 1645;
    /**
     * 远古之路 特殊奖励信息
     */
    int H1646 = 1646;
    /**
     * 远古之路 领取特殊奖励
     */
    int H1647 = 1647;
    /**
     * 远古之路 修改我方阵型
     */
    int H1648 = 1648;

    /**
     * 宠物图鉴信息
     */
    int H1660 = 1660;


    // 宠物训练中心========================================
    /**
     * 初始化
     */
    int H1681 = 1681;
    /**
     * 开始训练
     */
    int H1682 = 1682;
    /**
     * 升级/解锁栏位
     */
    int H1683 = 1683;
    /**
     * 扩展背包
     */
    int H1684 = 1684;

    // 符文========================================
    /**
     * 符文列表
     */
    int H1701 = 1701;
    /**
     * 镶嵌符文
     */
    int H1702 = 1702;
    /**
     * 取下符文
     */
    int H1703 = 1703;
    /**
     * 强化符文
     */
    int H1704 = 1704;
    /**
     * 洗炼符文
     */
    int H1705 = 1705;
    /**
     * 洗炼符文-确认
     */
    int H1706 = 1706;
    /**
     * 洗炼符文-放弃
     */
    int H1707 = 1707;
    /**
     * 符文分解
     */
    int H1708 = 1708;

    // 道馆========================================
    /**
     * 获取道馆
     */
    int H1721 = 1721;
    /**
     * 开始比赛
     */
    int H1722 = 1722;
    /**
     * 获取道馆排行榜
     */
    int H1723 = 1723;

    // 支援组合====================================
    /**
     * 获取组合
     */
    int H1741 = 1741;
    /**
     * 更新组合
     */
    int H1742 = 1742;

    // 无尽秘境====================================
    /**
     * 无尽秘境-获取信息
     */
    int H1761 = 1761;
    /**
     * 无尽秘境-更新阵形
     */
    int H1762 = 1762;
    /**
     * 无尽秘境-重置
     */
    int H1763 = 1763;
    /**
     * 无尽秘境-领取奖励
     */
    int H1764 = 1764;

    // 无尽秘境====================================


    // 充值========================================
    /**
     * 创建订单
     */
    int H1801 = 1801;
    /**
     * 充值,由充值服请求,user=System
     */
    int H1802 = 1802;
    /**
     * 验证平台充值订单是否完成
     */
    int H1803 = 1803;
    /**
     * 告知客户端某个订单号完成
     */
    int H1804 = 1804;

    // 平台充值
    /**
     * 苹果 AppStore
     */
    int H1811 = 1811;

    //冠军之路=========================================
    int H2500 = 2500;
    /**
     * 进入初始数据
     */
    int H2501 = 2501;
    /**
     * 进入战斗
     */
    int H2502 = 2502;
    /**
     * 结束战斗
     */
    int H2503 = 2503;
    /**
     * 领取节点奖励
     */
    int H2504 = 2504;
    /**
     * 领取周奖励
     */
    int H2505 = 2505;
    /**
     * 重置
     */
    int H2506 = 2506;
    /**
     * 更换阵型
     */
    int H2507 = 2507;
    /**
     * 冠军之路推送消息
     */
    int H2508 = 2508;
    /** 冠军之路扫荡 */
    int H251062 = 251062;


    // 精灵交换========================================
    /**
     * 初始化
     */
    int H2100 = 2100;
    /**
     * 普通交换-精灵交换/闪光交换
     */
    int H2101 = 2101;
    /**
     * 特殊交换-固定交换
     */
    int H2102 = 2102;
    /**
     * 使用祈愿卷刷新
     */
    int H2104 = 2104;
    /**
     * 特殊交换-替换/取消替换
     */
    int H2105 = 2105;
    /**
     * 特殊交换-刷新
     */
    int H2103 = 2103;
    /**
     * 闪光交换2-刷新精灵列表
     */
    int H2110 = 2110;
    /**
     * 闪光交换2
     */
    int H2111 = 2111;

    /**
     * 性格重置
     */
    int H2115 = 2115;


    //称号=========================================
    /**
     * 初始化 同步信息
     */
    int H2200 = 2200;
    /**
     * 更换称号
     */
    int H2201 = 2201;
    /**
     * 排行榜称号
     */
    int H2203 = 2203;

    // 角色换肤=========================================
    /**
     * 初始化 同步信息
     */
    int H2300 = 2300;
    /**
     * 更换称号
     */
    int H2301 = 2301;

    // 角色徽章=========================================
    /**
     * 初始化 同步信息
     */
    int H2400 = 2400;

    /**
     * 获取角色所在场景,状态等信息RoleInfo
     */
    int H2001 = 2001;
    /**
     * 获取场景中的玩家角色信息,状态信息
     */
    int H2002 = 2002;
    /**
     * 移动
     */
    int H2003 = 2003;
    /**
     * 获取场景中所有玩家的位置信息
     */
    int H2004 = 2004;
    /**
     * 进入场景
     */
    int H2005 = 2005;
    /**
     * 抓怪
     */
    int H2006 = 2006;
    /**
     * 遭遇怪
     */
    int H2007 = 2007;
    /**
     * 选择跟随宠物
     */
    int H2008 = 2008;
    /**
     * 拾取物品
     */
    int H2009 = 2009;
    /**
     * 访问NPC
     */
    int H2010 = 2010;
    /**
     * 领取区域图鉴奖励
     */
    int H2011 = 2011;
    /**
     * 区域更新怪物
     */
    int H2012 = 2012;
    /**
     * 设置区域显示玩家数
     */
    int H2013 = 2013;
    /**
     * 获得雕像
     */
    int H2014 = 2014;

    /**
     * 领取世界图鉴奖励
     */
    int H2015 = 2015;
    /**
     * 世界图鉴奖励信息
     */
    int H2016 = 2016;

    /**
     * 获取狩猎场数据
     */
    int H2021 = 2021;
    /**
     * 开始狩猎
     */
    int H2022 = 2022;
    /**
     * 狩猎场使用物品
     */
    int H2023 = 2023;
    /**
     * 进入狩猎场场景
     */
    int H2024 = 2024;
    /**
     * 退出狩猎场场景
     */
    int H2025 = 2025;

    /**
     * 开始钓鱼
     */
    int H2041 = 2041;

    // 精灵入侵====================================
    /**
     * 精灵入侵-开始战斗
     */
    int H2061 = 2061;

    // ARPG 野外遇怪 ==============================
    /**
     * 获取区域怪物
     */
    int H2071 = 2071;
    /**
     * 刷新据点怪物
     */
    int H2072 = 2072;


    // 提醒========================================
    /**
     * 更新提醒
     */
    int H5000 = 5000;

    // 聊天========================================
    /**
     * 获取聊天记录
     */
    int H5001 = 5001;
    /**
     * 发送聊天记录
     */
    int H5002 = 5002;
    /**
     * 拉黑玩家
     */
    int H5003 = 5003;
    /**
     * 投诉玩家
     */
    int H5004 = 5004;
    /**
     * 读取拉黑名单
     */
    int H5005 = 5005;
    /**
     * 读取公告消息
     */
    int H5006 = 5006;
    /**
     * 物品展示
     */
    int H5007 = 5007;
    /**
     * 读取物品展示信息
     */
    int H5008 = 5008;

    /**
     * 冒泡表情
     */
    int H5011 = 5011;

    /**
     * 获取最后一条聊天信息
     */
    int H5009 = 5009;

    // 邮件========================================
    /**
     * 获取邮件信息
     */
    int H5101 = 5101;
    /**
     * 发送邮件信息
     */
    int H5102 = 5102;
    /**
     * 删除邮件
     */
    int H5103 = 5103;
    /**
     * 领取邮件奖励
     */
    int H5104 = 5104;
    /**
     * 全部领取
     */
    int H5105 = 5105;
    /**
     * 新邮件
     */
    int H5106 = 5106;
    // 好友========================================
    /**
     * 读取好友列表
     */
    int H5201 = 5201;
    /**
     * 搜索好友
     */
    int H5202 = 5202;
    /**
     * 好友申请
     */
    int H5203 = 5203;
    /**
     * 读取申请添加你的好友邀请
     */
    int H5204 = 5204;
    /**
     * 接受新的好友请求消息
     */
    int H5210 = 5210;
    /**
     * 读取你发送出去的好友邀请(刷新)
     */
    int H5205 = 5205;
    /**
     * 取消(拒绝)好友邀请
     */
    int H5206 = 5206;
    /**
     * 确定好友邀请
     */
    int H5207 = 5207;
    /**
     * 删除好友
     */
    int H5208 = 5208;
    /**
     * 友情值贈送
     */
    int H5209 = 5209;
    /**
     * 赠送体力
     */
    int H5211 = 5211;
    /**
     * 领取体力
     */
    int H5212 = 5212;
    /**
     * 好友push消息
     */
    int H5213 = 5213;
    /**
     * 好友一键赠送体力
     */
    int H5214 = 5214;
    /**
     * 好友一键领取体力
     */
    int H5215 = 5215;

    /**
     * 好友切磋
     */
    int H5230 = 5230;
    /**
     * 好友切磋
     */
    int H5231 = 5231;
    /**
     * 好友切磋
     */
    int H5232 = 5232;
    /**
     * 屏蔽好友切磋
     */
    int H5233 = 5233;
    /**
     * 擂台信息
     */
    int H5250 = 5250;
    /**
     * 屏蔽擂台信息
     */
    int H5251 = 5251;
    /**
     * 创建擂台
     */
    int H5252 = 5252;
    /**
     * 退出擂台
     */
    int H5253 = 5253;
    /**
     * 挑战擂台
     */
    int H5254 = 5254;
    /**
     * 快速加入擂台
     */
    int H5255 = 5255;
    /**
     * 搜索擂台
     */
    int H5256 = 5256;
    /**
     * 通知进入准备界面(推送)
     */
    int H5257 = 5257;
    /**
     * 通知列表变化(推送)
     */
    int H5258 = 5258;
    /**
     * 玩家在擂台状态(推送)
     */
    int H5259 = 5259;
    /**
     * 擂台准备
     */
    int H5260 = 5260;


    // 提醒========================================
    /**
     * 更新提醒
     */
    int H5300 = 5300;

    // 设置========================================
    /**
     * 提交设置
     */
    int H6001 = 6001;
    /**
     * 读取设置
     */
    int H6005 = 6005;
    /**
     * 改名提交
     */
    int H6002 = 6002;
    /**
     * 修改头像url
     */
    int H6003 = 6003;
    /**
     * 修改头像框
     */
    int H6004 = 6004;
    /**
     * 兑换兑换码
     */
    int H6101 = 6101;
    /**
     * 发送bug回馈
     */
    int H6201 = 6201;
    /**
     * 获取每日登陆信息
     */
    int H6301 = 6301;
    /**
     * 领取登陆奖励(当天)
     */
    int H6302 = 6302;

    /**
     * 获取vip礼包状态
     */
    int H6303 = 6303;
    /**
     * 获取vip礼包
     */
    int H6304 = 6304;
    /**
     * 在线礼包
     */
    int H6305 = 6305;
    /**
     * 获取在线礼包
     */
    int H6306 = 6306;

    // 运营========================================
    /**
     * 获取活动主界面列表
     */
    int H6502 = 6502;
    /**
     * 活動更新下发
     */
    int H6503 = 6503;
    /**
     * 领取充值返还
     */
    int H6504 = 6504;
    /**
     * 领取活动奖励
     */
    int H6505 = 6505;
    /**
     * 读取活动状态
     */
    int H6506 = 6506;
    /**
     * 读取广告版列表
     */
    int H6501 = 6501;
    /**
     * 广告消息
     */
    int H6507 = 6507;
    /**
     * 英雄领取状态消息
     */
    int H6508 = 6508;
    /**
     * 执行活动额外处理
     */
    int H6509 = 6509;
    // 新手引导======================================
    // /** 开始新手引导 */
    // int H6601 = 6601;
    // /** 完成新手引导 */
    // int H6602 = 6602;
    /**
     * 获取新手引导信息
     */
    int H6603 = 6603;
    /**
     * 完成新手引导
     */
    int H6604 = 6604;
    /**
     * 完成引导子步骤
     */
    int H6605 = 6605;
    /**
     * 记录新手引导操作日志
     */
    int H6606 = 6606;
    
    /**
     * 场景动画信息
     */
    int H6607 = 6607;
    
    /**
     * 完成场景动画
     */
    int H6608 = 6608;

    // 模块开启======================================
    /**
     * 模块信息获取
     */
    int H6701 = 6701;
    /**
     * 开启模块
     */
    int H6702 = 6702;
    /**
     * 完成模块开启
     */
    int H6703 = 6703;

    // 背包========================================
    /**
     * 读取背包信息
     */
    int H7001 = 7001;
    /**
     * 打开物品, 和新增物品消息
     */
    int H7002 = 7002;
    /**
     * 出售物品
     */
    int H7003 = 7003;
    /**
     * 打开宝箱2
     */
    int H7004 = 7004;
    /**
     * 下发宝箱列表
     */
    int H7005 = 7005;
    /**
     * 扩展背包
     */
    int H7006 = 7006;
    /**
     * 批量使用物品
     */
    int H7007 = 7007;
    /**
     * 物品收集记录
     */
    int H7008 = 7008;

    // 商城========================================
    /**
     * 读取商城页面信息
     */
    int H7100 = 7100;
    /**
     * 商城提醒
     */
    int H7107 = 7107;
    /**
     * 首冲提信息
     */
    int H7108 = 7108;
    /**
     * 领取首冲
     */
    int H7109 = 7109;
    /**
     * 累充信息
     */
    int H7110 = 7110;
    /**
     * 领取累充奖励
     */
    int H7111 = 7111;
    /**
     * 获取天天礼包数据
     */
    int H7112 = 7112;
    /**
     * 天天礼包领取礼包
     */
    int H7113 = 7113;
    /**
     * 转盘面板数据
     */
    int H7120 = 7120;
    /**
     * 转盘排行榜
     */
    int H7121 = 7121;
    /**
     * 转盘消息
     */
    int H7122 = 7122;
    /**
     * 转盘请求
     */
    int H7123 = 7123;
    /**
     * 限时神兽主面板数据
     */
    int H7130 = 7130;
    /**
     * 限时神兽排行榜
     */
    int H7131 = 7131;
    /**
     * 限时神兽积分获取数据
     */
    int H7132 = 7132;
    /**
     * 获取活动开启列表
     */
    int H7140 = 7140;

    /**
     * 充值
     */
    int H7101 = 7101;
    /**
     * 购买金币
     */
    int H7102 = 7102;
    /**
     * 购买行动力
     */
    int H7103 = 7103;
    /**
     * 读取行动力购买信息
     */
    int H7104 = 7104;
    /**
     * 购买月卡
     */
    int H7105 = 7105;
    /**
     * 购买限时礼包
     */
    int H7106 = 7106;


    /**
     * 充值排行
     */
    int H7150 = 7150;
    /**
     * 消费排行
     */
    int H7153 = 7153;

    /**
     * 充值返利转盘
     */
    int H7156 = 7156;
    /**
     * 充值返利转盘
     */
    int H7157 = 7157;

    /**
     * 积分兑换活动
     */
    int H7160 = 7160;
    /**
     * 神秘礼包活动
     */
    int H7161 = 7161;


    /**
     * 召唤英雄(单次)
     */
    int H7201 = 7201;
    /**
     * 召唤英雄(十次)
     */
    int H7202 = 7202;
    /**
     * 物品抽奖(单次)
     */
    int H7301 = 7301;
    /**
     * 物品抽奖(十次)
     */
    int H7302 = 7302;
    /**
     * VIP信息获取
     */
    int H7401 = 7401;
    /**
     * VIP礼包购买
     */
    int H7402 = 7402;

    /**
     * 获取循环充值数据
     */
    int H7410 = 7410;

    /**
     * 获取主题精灵数据
     */
    int H7420 = 7420;
    /**
     * 领取主题精灵
     */
    int H7421 = 7421;

    // 任务成就========================================
    /**
     * 读取任务成就列表
     */
    int H8001 = 8001;
    /**
     * 完成任务成就
     */
    int H8002 = 8002;
    /**
     * 任务成就更新
     */
    int H8003 = 8003;
    /**
     * 获取任务累计奖励
     */
    int H8004 = 8004;
    /**
     * 获取成就累计奖励
     */
    int H8005 = 8005;
    /**
     * 领取/放弃任务（悬赏）
     */
    int H8006 = 8006;
    /**
     * 完成任务领取奖励(悬赏)
     */
    int H8007 = 8007;
    /**
     * 刷新任务(悬赏)
     */
    int H8008 = 8008;
    /**
     * 快速完成(悬赏)
     */
    int H8009 = 8009;
    /**
     * 领取任务
     */
    int H8010 = 8010;


    //查看玩家信息
    /**
     * 查看玩家信息
     */
    int H8100 = 8100;

    //公会==========================================
    /**
     * 读取公会
     */
    int H9000 = 9000;
    /**
     * 创建公会
     */
    int H9001 = 9001;
    /**
     * 公会基本信息
     */
    int H9002 = 9002;
    /**
     * 公会列表
     */
    int H9003 = 9003;
    /**
     * 公会成员列表（推送）
     */
    int H9004 = 9004;
    /**
     * 申请加入公会
     */
    int H9005 = 9005;
    /**
     * 同意申请入会
     */
    int H9006 = 9006;
    /**
     * 获取申请列表
     */
    int H9007 = 9007;
    /**
     * 公会操作
     */
    int H9008 = 9008;
    /**
     * 更改公会图标
     */
    int H9009 = 9009;
    /**
     * 设置公会宣言
     */
    int H9010 = 9010;
    /**
     * 设置入会条件
     */
    int H9011 = 9011;
    /**
     * 获取公会排行榜
     */
    int H9012 = 9012;
    /**
     * 获取公会日志
     */
    int H9013 = 9013;
    /**
     * 取消公会申请
     */
    int H9014 = 9014;
    /**
     * 查找公会
     */
    int H9015 = 9015;
    /**
     * 公会消息提醒
     */
    int H9016 = 9016;
    /**
     * 公会果蔬灌溉
     */
    int H9017 = 9017;
    /**
     * 公会领取果实
     */
    int H9018 = 9018;
    /**
     * 公会公会果树信息
     */
    int H9019 = 9019;
    /**
     * 公会果树状态重置
     */
    int H9020 = 9020;
    /**
     * 公会膜拜雕像
     */
    int H9021 = 9021;
    /**
     * 公会雕像
     */
    int H9022 = 9022;
    /**
     * 公会排行榜
     */
    int H9023 = 9023;
    /**
     * 提交守护精灵
     */
    int H9024 = 9024;
    /**
     * 列出公会守护精灵列表
     */
    int H9025 = 9025;
    /**
     * 公会捕捉任务上交
     */
    int H9026 = 9026;
    /**
     * 公会捕捉任务信息
     */
    int H9027 = 9027;
    /**
     * 公会研究信息
     */
    int H9028 = 9028;
    /**
     * 升级公会研究
     */
    int H9029 = 9029;
    /**
     * 公会科技信息
     */
    int H9030 = 9030;
    /**
     * 解锁公会科技
     */
    int H9031 = 9031;
    /**
     * 升级公会科技
     */
    int H9032 = 9032;

    // 行动力========================================
    /**
     * 读取体力信息
     */
    int H9101 = 9101;
    /**
     * 恢复疲劳度
     */
    int H9102 = 9102;
    /**
     * 获取购买疲劳度信息
     */
    int H9103 = 9103;
    /**
     * 购买疲劳度
     */
    int H9104 = 9104;

    //精灵特性========================================

    // 精灵特性========================================
    /**
     * 原石训练栏列表
     */
    int H9500 = 9500;
    /**
     * 激活特性
     */
    int H9501 = 9501;
    /**
     * 解锁原石研究栏
     */
    int H9502 = 9502;
    /**
     * 开始原石研究
     */
    int H9503 = 9503;
    /**
     * 立即完成研究
     */
    int H9504 = 9504;
    /**
     * 中断研究
     */
    int H9505 = 9505;
    /**
     * 开启原石研究成果
     */
    int H9506 = 9506;
    /**
     * 特性石分解
     */
    int H9507 = 9507;
    /**
     * 装备合成
     */
    int H9508 = 9508;
    
    // ==============精灵矿洞=================
    /**
     * 获得矿洞数据
     */
    int H9601 = 9601;
    /**
     * 刷新矿洞对应矿石
     */
    int H9602 = 9602;
    /**
     * 选择矿工
     */
    int H9603 = 9603;
    /**
     * 开始挖矿
     */
    int H9604 = 9604;
    /**
     * 中断挖矿
     */
    int H9605 = 9605;
    /**
     * 获得打劫矿洞的列表
     */
    int H9606 = 9606;
    /**
     * 选择自己的打劫精灵
     */
    int H9607 = 9607;
    /**
     * 打劫矿洞
     */
    int H9608 = 9608;
    /**
     * 选择适当的精灵守护
     */
    int H9609 = 9609;
    /**
     * 选择适当的精灵守护
     */
    int H9610 = 9610;
    
    // Web访问========================================
    /**
     * 读取服务器列表
     */
    int H10001 = 10001;

    /**
     * 登陆验证
     */
    int H10002 = 10002;

    /**
     * 登陆检测
     */
    int H10003 = 10003;

    /**
     * 更新角色
     */
    int H10004 = 10004;

    /**
     * 读取用户信息
     */
    int H10005 = 10005;

    /**
     * 读取用户全部信息
     */
    int H10006 = 10006;

    // Web操作========================================
    /**
     * 发送邮件
     */
    int H11001 = 11001;
    /**
     * 邮件列表
     */
    int H11002 = 11002;
    /**
     * 删除邮件
     */
    int H11003 = 11003;
    /**
     * GM指令列表读取
     */
    int H11101 = 11101;
    /**
     * GM指令发送
     */
    int H11102 = 11102;

    // Web公告========================================
    /**
     * 系统聊天发送
     */
    int H12001 = 12001;

    /**
     * 获取黑名单
     */
    int H12101 = 12101;
    /**
     * 拉黑玩家
     */
    int H12102 = 12102;

    /**
     * 走马灯
     */
    int H12201 = 12201;
    /**
     * 走马灯列表
     */
    int H12202 = 12202;
    /**
     * 删除走马灯
     */
    int H12203 = 12203;

    // Web权限========================================
    /**
     * 封号
     */
    int H13001 = 13001;
    /**
     * 获取封号列表
     */
    int H13002 = 13002;

    // 日志========================================
    /**
     * 获取日志信息
     */
    int H14001 = 14001;
    /**
     * 获取系统日志内容
     */
    int H14004 = 14004;

    // bug========================================
    /**
     * 获取bug信息
     */
    int H14101 = 14101;
    /**
     * 提交bug信息
     */
    int H14102 = 14102;
    /**
     * 删除bug信息
     */
    int H14103 = 14103;

    // 服务器=======================================
    /**
     * 关服通知提醒
     */
    int H9201 = 9201;
    /**
     * 关闭服务器入口,踢人
     */
    int H14002 = 14002;

    // Web充值=======================================
    /**
     * 创建订单
     */
    int H40001 = 40001;

    // cdkey=======================================
    /**
     * cdkey
     */
    int H17001 = 17001;

    // 统计数据=======================================
    /**
     * 统计
     */
    int H18001 = 18001;

    // 活动=======================================
    /**
     * 设置活动
     */
    int H19001 = 19001;
    /**
     * 获取活动列表
     */
    int H19002 = 19002;
    /**
     * 删除活动
     */
    int H19003 = 19003;

    /** 额外掉落活动 */
	int H2520001 = 2520001;
    
    // 礼包=========================================
    // UC礼包
    /**
     * 领取UC礼包
     */
    int H19021 = 19021;

    // 错误=======================================
    /**
     * 错误消息
     **/
    int H0 = 0;

    // ==========================================
    // ==================PVP=====================
    // ==========================================
    /**
     * 请求PVP匹配
     */
    int H1901 = 1901;
    /**
     * PVP匹配结果
     */
    int H1902 = 1902;
    /**
     * PVP取消匹配
     */
    int H1903 = 1903;
//    /**
//     * PVP战斗结果
//     */
//    int H1904 = 1904;
    /**
     * PVP战斗结果2,皇家对战新增,用于替代1904
     */
    int H1905 = 1905;

    /**
     * PVP战斗信息
     */
    int H1911 = 1911;

    /**
     * PVP4p 皇家对战战斗信息
     */
    int H1921 = 1921;

    // PVPCenter > GameServer
    /**
     * 心跳
     */
    int H20000 = 20000;

    /**
     * 注册Center
     */
    int H20001 = 20001;

    /**
     * 取消注册Center
     */
    int H20002 = 20002;

    /**
     * 接受PVP服登录令牌
     */
    int H20003 = 20003;

    /**
     * PVP战斗结果
     */
    int H20004 = 20004;

    /**
     * 取消匹配结果
     */
    int H20005 = 20005;

    /**
     * 接收公会世界排行榜更新
     */
    int H20020 = 20020;

    /**
     * 接收个人世界排行榜更新
     */
    int H20030 = 20030;

    /**
     * 接收道馆排行榜更新
     */
    int H20050 = 20050;

    int H22001 = 22001;
    int H22002 = 22002;

    /**
     * 扭蛋积分
     */
    int H251001 = 251001;

    int H251002 = 251002;

    int H251003 = 251003;

    int H251004 = 251004;

    int H251005 = 251005;

    int H251006 = 251006;

    /**
     * 碎片合成
     */
    int H251007 = 251007;

    int H251009 = 251009;

    /**
     * 客户端请求扭蛋打折、双倍积分活动活动信息
     */
    int H251010 = 251010;
    
    /**
     * 精灵装备
     */
    int H251011 = 251011;
    
    /**
     * 精灵蛋
     */
    //操作
    int H251012 = 251012;
    //好友援助界面
    int H251013 = 251013;
    //获得蛋
    int H251014 = 251014;
    //获得日志
    int H251015 = 251015;
    
    /**
     * 符文
     */
    // 251016 穿上符文
    int H251016 = 251016;
    // 251017 卸载符文
    int H251017 = 251017;
    // 251018 批量熔炼符文
    int H251018 = 251018;
    // 251019 合成符文
    int H251019 = 251019;
    // 251020 分解符文
    int H251020 = 251020;
    
    /**
     * 角色动作表情
     */
    int H251031 = 251031;
    
    /**
     * moba3v3
     */
    int H251041 = 251041;
    
    /**
     * 精灵装备分解
     */
    int H251051 = 251051;
    
    /**
     * 立即传送
     */
    int H251052 = 251052;
    /**
     * 刷新玩家累积游戏时长
     */
    int H251053 = 251053;
    
    /**
     * 虚拟对战商店
     */
    //获取商店数据
    int H251054 = 251054;
    //刷新
    int H251055 = 251055;
    //购买
    int H251056 = 251056;

}
