#login
1000=\u0e44\u0e2d\u0e14\u0e35\u0e16\u0e39\u0e01\u0e41\u0e1a\u0e19 \u0e2b\u0e32\u0e01\u0e21\u0e35\u0e02\u0e49\u0e2d\u0e2a\u0e07\u0e2a\u0e31\u0e22\u0e42\u0e1b\u0e23\u0e14\u0e15\u0e34\u0e14\u0e15\u0e48\u0e2d CS! 
1001=\u0e1b\u0e23\u0e31\u0e1a\u0e01\u0e32\u0e23\u0e25\u0e47\u0e2d\u0e01\u0e2d\u0e34\u0e19\u0e44\u0e21\u0e48\u0e2a\u0e33\u0e40\u0e23\u0e47\u0e08
1002=\u0e41\u0e1e\u0e25\u0e15\u0e1f\u0e2d\u0e23\u0e4c\u0e21\u0e17\u0e35\u0e48\u0e44\u0e21\u0e48\u0e23\u0e39\u0e49\u0e08\u0e31\u0e01 \u0e25\u0e47\u0e2d\u0e01\u0e2d\u0e34\u0e19\u0e44\u0e21\u0e48\u0e2a\u0e33\u0e40\u0e23\u0e47\u0e08
1003=\u0e02\u0e49\u0e2d\u0e21\u0e39\u0e25{0}\u0e44\u0e21\u0e48\u0e16\u0e39\u0e01\u0e15\u0e49\u0e2d\u0e07 \u0e02\u0e49\u0e2d\u0e21\u0e39\u0e25\u0e17\u0e35\u0e48\u0e15\u0e49\u0e2d\u0e07\u0e43\u0e0a\u0e49: {1}
1004={0}
1005=\u0e44\u0e21\u0e48\u0e1e\u0e1a\u0e44\u0e2d\u0e14\u0e35
1006=\u0e2a\u0e23\u0e49\u0e32\u0e07\u0e44\u0e2d\u0e14\u0e35\u0e44\u0e21\u0e48\u0e2a\u0e33\u0e40\u0e23\u0e47\u0e08
1007=\u0e23\u0e2b\u0e31\u0e2a\u0e1c\u0e48\u0e32\u0e19\u0e1c\u0e34\u0e14
1008=Error!
1009=\u0e42\u0e1b\u0e23\u0e14\u0e2d\u0e31\u0e1e\u0e40\u0e1b\u0e47\u0e19\u0e40\u0e27\u0e2d\u0e23\u0e4c\u0e0a\u0e31\u0e19\u0e25\u0e48\u0e32\u0e2a\u0e38\u0e14!
1010=\u0e44\u0e2d\u0e14\u0e35\u0e44\u0e21\u0e48\u0e2a\u0e32\u0e21\u0e32\u0e23\u0e16\u0e40\u0e27\u0e49\u0e19\u0e27\u0e48\u0e32\u0e07\u0e44\u0e14\u0e49
1011=\u0e44\u0e2d\u0e14\u0e35\u0e21\u0e35\u0e2d\u0e31\u0e01\u0e02\u0e23\u0e30\u0e44\u0e21\u0e48\u0e40\u0e2b\u0e21\u0e32\u0e30\u0e2a\u0e21
1012=\u0e23\u0e2b\u0e31\u0e2a\u0e1c\u0e48\u0e32\u0e19\u0e44\u0e21\u0e48\u0e2a\u0e32\u0e21\u0e32\u0e23\u0e16\u0e40\u0e27\u0e49\u0e19\u0e27\u0e48\u0e32\u0e07\u0e44\u0e14\u0e49
1013=\u0e21\u0e35\u0e44\u0e2d\u0e14\u0e35\u0e19\u0e35\u0e49\u0e41\u0e25\u0e49\u0e27
1014=\u0e42\u0e1b\u0e23\u0e14\u0e01\u0e23\u0e2d\u0e01\u0e42\u0e04\u0e49\u0e14\u0e40\u0e1b\u0e34\u0e14\u0e43\u0e0a\u0e49\u0e17\u0e35\u0e48\u0e16\u0e39\u0e01\u0e15\u0e49\u0e2d\u0e07
1015=\u0e42\u0e1b\u0e23\u0e14\u0e01\u0e23\u0e2d\u0e01\u0e42\u0e04\u0e49\u0e14\u0e40\u0e1b\u0e34\u0e14\u0e43\u0e0a\u0e49\u0e17\u0e35\u0e48\u0e16\u0e39\u0e01\u0e15\u0e49\u0e2d\u0e07
1016=\u0e42\u0e04\u0e49\u0e14\u0e40\u0e1b\u0e34\u0e14\u0e43\u0e0a\u0e49\u0e19\u0e35\u0e49\u0e40\u0e04\u0e22\u0e43\u0e0a\u0e49\u0e07\u0e32\u0e19\u0e41\u0e25\u0e49\u0e27
1017=\u0e41\u0e01\u0e49\u0e44\u0e02\u0e42\u0e04\u0e49\u0e14\u0e40\u0e1b\u0e34\u0e14\u0e43\u0e0a\u0e49\u0e44\u0e21\u0e48\u0e2a\u0e33\u0e40\u0e23\u0e47\u0e08
1018=\u0e44\u0e2d\u0e14\u0e35\u0e44\u0e21\u0e48\u0e16\u0e39\u0e01\u0e15\u0e49\u0e2d\u0e07
1019=\u0e23\u0e2b\u0e31\u0e2a\u0e1c\u0e48\u0e32\u0e19\u0e43\u0e2b\u0e21\u0e48\u0e44\u0e21\u0e48\u0e2a\u0e32\u0e21\u0e32\u0e23\u0e16\u0e40\u0e27\u0e49\u0e19\u0e27\u0e48\u0e32\u0e07\u0e44\u0e14\u0e49
1020=\u0e23\u0e2b\u0e31\u0e2a\u0e1c\u0e48\u0e32\u0e19\u0e17\u0e35\u0e48\u0e40\u0e1b\u0e25\u0e35\u0e48\u0e22\u0e19\u0e40\u0e2b\u0e21\u0e37\u0e2d\u0e19\u0e01\u0e31\u0e19
1021=IP \u0e19\u0e35\u0e49\u0e16\u0e39\u0e01\u0e41\u0e1a\u0e19\u0e44\u0e21\u0e48\u0e43\u0e2b\u0e49\u0e25\u0e47\u0e2d\u0e01\u0e2d\u0e34\u0e19 \u0e2b\u0e32\u0e01\u0e21\u0e35\u0e02\u0e49\u0e2d\u0e2a\u0e07\u0e2a\u0e31\u0e22\u0e42\u0e1b\u0e23\u0e14\u0e15\u0e34\u0e14\u0e15\u0e48\u0e2d CS! 
1022=\u0e44\u0e21\u0e48\u0e1e\u0e1a\u0e40\u0e0b\u0e34\u0e23\u0e4c\u0e1f\u0e40\u0e27\u0e2d\u0e23\u0e4c
1023=\u0e01\u0e32\u0e23\u0e22\u0e37\u0e19\u0e22\u0e31\u0e19\u0e1c\u0e34\u0e14\u0e1e\u0e25\u0e32\u0e14
1024=\u0e44\u0e21\u0e48\u0e1e\u0e1a\u0e1c\u0e39\u0e49\u0e43\u0e0a\u0e49\u0e07\u0e32\u0e19{0}
1025=\u0e40\u0e0b\u0e34\u0e23\u0e4c\u0e1f\u0e40\u0e27\u0e2d\u0e23\u0e4c\u0e1b\u0e34\u0e14\u0e1b\u0e23\u0e31\u0e1a\u0e1b\u0e23\u0e38\u0e07 \u0e42\u0e1b\u0e23\u0e14\u0e25\u0e2d\u0e07\u0e43\u0e2b\u0e21\u0e48\u0e20\u0e32\u0e22\u0e2b\u0e25\u0e31\u0e07
1026=\u0e42\u0e04\u0e49\u0e14\u0e22\u0e37\u0e19\u0e22\u0e31\u0e19\u0e2b\u0e21\u0e14\u0e2d\u0e32\u0e22\u0e38

#Bind
1027=ID\u0e15\u0e31\u0e27\u0e25\u0e30\u0e04\u0e23\u0e44\u0e21\u0e48\u0e16\u0e39\u0e01\u0e15\u0e49\u0e2d\u0e07

#CDKey
1028=\u0e0a\u0e48\u0e2d\u0e07\u0e17\u0e32\u0e07\u0e17\u0e35\u0e48\u0e44\u0e21\u0e48\u0e23\u0e39\u0e49\u0e08\u0e31\u0e01
1029=\u0e44\u0e21\u0e48\u0e1e\u0e1a\u0e42\u0e04\u0e49\u0e14\u0e40\u0e1b\u0e34\u0e14\u0e43\u0e0a\u0e49
1030=\u0e42\u0e04\u0e49\u0e14\u0e40\u0e1b\u0e34\u0e14\u0e43\u0e0a\u0e49\u0e19\u0e35\u0e49\u0e16\u0e39\u0e01\u0e43\u0e0a\u0e49\u0e44\u0e1b\u0e41\u0e25\u0e49\u0e27
1031=\u0e42\u0e04\u0e49\u0e14\u0e40\u0e1b\u0e34\u0e14\u0e43\u0e0a\u0e49\u0e2b\u0e21\u0e14\u0e2d\u0e32\u0e22\u0e38\u0e41\u0e25\u0e49\u0e27
1032=\u0e41\u0e1e\u0e25\u0e15\u0e1f\u0e2d\u0e23\u0e4c\u0e21\u0e19\u0e35\u0e49\u0e44\u0e21\u0e48\u0e2a\u0e32\u0e21\u0e32\u0e23\u0e16\u0e23\u0e31\u0e1a\u0e41\u0e1e\u0e04\u0e19\u0e35\u0e49\u0e44\u0e14\u0e49
1033=\u0e41\u0e1e\u0e04\u0e19\u0e35\u0e49\u0e16\u0e39\u0e01\u0e1c\u0e39\u0e49\u0e2d\u0e37\u0e48\u0e19\u0e23\u0e31\u0e1a\u0e44\u0e1b\u0e41\u0e25\u0e49\u0e27!
1034=\u0e44\u0e21\u0e48\u0e1e\u0e1a\u0e1c\u0e39\u0e49\u0e43\u0e0a\u0e49\u0e07\u0e32\u0e19!
1035=\u0e04\u0e38\u0e13\u0e23\u0e31\u0e1a\u0e41\u0e1e\u0e04\u0e43\u0e19\u0e1b\u0e23\u0e30\u0e40\u0e20\u0e17\u0e40\u0e14\u0e35\u0e22\u0e27\u0e01\u0e31\u0e19\u0e44\u0e1b\u0e41\u0e25\u0e49\u0e27!
1036=\u0e08\u0e33\u0e19\u0e27\u0e19\u0e01\u0e32\u0e23\u0e43\u0e0a\u0e49\u0e41\u0e1e\u0e04\u0e1b\u0e23\u0e30\u0e40\u0e20\u0e17\u0e19\u0e35\u0e49\u0e16\u0e36\u0e07\u0e25\u0e34\u0e21\u0e34\u0e15\u0e41\u0e25\u0e49\u0e27
1037=\u0e41\u0e1e\u0e04\u0e1b\u0e23\u0e30\u0e40\u0e20\u0e17\u0e19\u0e35\u0e49\u0e41\u0e08\u0e01\u0e40\u0e2a\u0e23\u0e47\u0e08\u0e2a\u0e34\u0e49\u0e19\u0e41\u0e25\u0e49\u0e27
